DataProcessors/Табель.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>Табель</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/Табель.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Табель</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументОтклонения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОтклоненияРабочихДней</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипДня</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыРабочихДней</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/Табель/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Перем КоличествоДнейВМесяце;

&НаКлиенте
Процедура МесяцРегулирование(Элемент, Направление, СтандартнаяОбработка)
	Месяц = омМесяц.МесяцРегулированиеНаСервере(ЭтаФорма.Месяц,Направление);
	СформироватьТабель();
КонецПроцедуры 

Процедура ЗаполнитьНаСервереМесяцы()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Месяцы.Наименование КАК Наименование,
		|	Месяцы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Месяцы КАК Месяцы
		|
		|УПОРЯДОЧИТЬ ПО
		|	Месяцы.Код";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Элементы.Месяц.СписокВыбора.Добавить(Выборка.Ссылка,Выборка.Наименование);
	КонецЦикла;
	
	
	Если ТекущийМесяц = Дата(1,1,1) Тогда
		ТД = ТекущаяДата();
		Если (ТД <= НачалоПериода ИЛИ ТД >= ОкончаниеПериода) И ОкончаниеПериода > Дата(1, 1, 1) Тогда
			ТД = НачалоПериода;	
		КонецЕсли; 
		Год = Год(ТД);
		ТекущийМесяц = НачалоМесяца(ТД);
		Месяц = Справочники.Месяцы.НайтиПоКоду(Месяц(ТД));
	Иначе
		Год = Год(ЭтаФорма.ТекущийМесяц);
		Месяц = Справочники.Месяцы.НайтиПоКоду(Месяц(ТекущийМесяц));
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьНаСервереМесяцы();
	СформироватьТабель();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКалендарь(Команда)
	
	Параметр = Новый Структура("НачалоМесяца", Дата(Год, НомерМесяцаНаССервере(Месяц), 1));
	ОткрытьФорму("Отчет.РабочиеЧасы.Форма.ФормаДобавитьРабочиеЧасы", Параметр, ЭтаФорма, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры 

&НаСервереБезКонтекста
Функция НомерМесяцаНаССервере(Месяц)

	Возврат ?(ЗначениеЗаполнено(Месяц), Месяц.Код, 0);	

КонецФункции // НомерМесяцаНаССервере()


&НаКлиенте
Процедура МесяцПриИзменении(Элемент)
	СформироватьТабель();
КонецПроцедуры

&НаКлиенте
Процедура ГодПриИзменении(Элемент)
	СформироватьТабель();
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	СформироватьТабель();
КонецПроцедуры

Процедура СформироватьТабель()

	ПолеВывода.Очистить();
	
	Если ЗначениеЗаполнено(Месяц) Тогда
		НомерМесяца = омМесяц.ПолучитьКодМесяца(Месяц);
	Иначе	
		НомерМесяца = 0;
	КонецЕсли;
	
	Если НомерМесяца = 0 ИЛИ Год = 0 Тогда
		Возврат;
	КонецЕсли;
	
	НачалоМесяца 	= Дата(Год, НомерМесяца, 1);
	КонецМесяца 	= КонецМесяца(НачалоМесяца);
	
	ТаблицаСотрудников = омТабельНаСервере.РаботающиеСотрудники(НачалоМесяца, Подразделение, Истина);	
	
	ДанныеТабеля = ПолучитьДанные(НачалоМесяца, КонецМесяца, омТЧ_НаКлиентеСервере.КолонкуВМассив(ТаблицаСотрудников, "Сотрудник"));
	
	Даты = омДаты.ПолучитьРабочиеДни(НачалоМесяца, КонецМесяца);
	
	Макет = Обработки.Табель.ПолучитьМакет("Макет");
	ВывестиШапку(Макет, Даты);
	
	ОбластиПодразделения = Новый Структура();
	ОбластиПодразделения.Вставить("Сотрудники", Макет.ПолучитьОбласть("Подразделение|Сотрудники"));
	ОбластиПодразделения.Вставить("Дата", 		Макет.ПолучитьОбласть("Подразделение|Дата"));
	ОбластиПодразделения.Вставить("Итого", 		Макет.ПолучитьОбласть("Подразделение|Итого"));
	
	Если ЗначениеЗаполнено(Подразделение) Тогда
		ВывестиПодразделение(Подразделение, Даты, ОбластиПодразделения);
		ВыводитьПодразделение = Ложь;
	Иначе
		ВыводитьПодразделение = Истина;
	КонецЕсли;
	
	
	
	
КонецПроцедуры 

Процедура ВывестиПодразделение(Подразделение, Даты, ОбластиПодразделения)

	ОбластиПодразделения.Сотрудники.Параметры.Подразделение = Подразделение;
	ПолеВывода.Вывести(ОбластиПодразделения.Сотрудники);
	
	Для каждого х Из Даты Цикл
	
		ПолеВывода.Присоединить(ОбластиПодразделения.Дата);
		
	КонецЦикла;
	
	ПолеВывода.Присоединить(ОбластиПодразделения.Итого);


КонецПроцедуры


Процедура ВывестиШапку(Макет, Даты)

	ПолеВывода.Вывести(Макет.ПолучитьОбласть("Шапка|Сотрудники"));
	
	ТекущаяОбласть 	= Макет.ПолучитьОбласть("Шапка|Дата"); 
	ТекущаяОбластьВ = Макет.ПолучитьОбласть("Шапка|Выходной");
	
	Для каждого х Из Даты Цикл
	
		Если х.РабочиеЧасы = 0 Тогда
			Область = ТекущаяОбластьВ;
		Иначе
			Область = ТекущаяОбласть;
		КонецЕсли;
		
		Область.Параметры.Дата = День(х.Дата);
		ПолеВывода.Присоединить(Область);
		
	КонецЦикла;
	
	ПолеВывода.Присоединить(Макет.ПолучитьОбласть("Шапка|Итого"));


КонецПроцедуры


Функция ПолучитьДанные(НачалоМесяца, КонецМесяца, МассивСотрудников)

	ДанныеТабеля = ПолучитьДанныеТабеля(НачалоМесяца);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Табель.Дата КАК Дата,
		|	Табель.Сотрудник КАК Сотрудник,
		|	Табель.ТипДня.ПредставлениеВОтчетах КАК ТипДняПредставлениеВОтчетах,
		|	Табель.КоличествоЧасов КАК КоличествоЧасов,
		|	Табель.ДокументОтклонения КАК ДокументОтклонения,
		|	Табель.Сотрудник.Наименование КАК СотрудникНаименование
		|ИЗ
		|	РегистрСведений.Табель КАК Табель
		|ГДЕ
		|	Табель.Дата >= &ДатаНачала
		|	И Табель.Дата <= &ДатаОкончания
		|	И Табель.Сотрудник В(&СписокСотрудников)
		|
		|УПОРЯДОЧИТЬ ПО
		|	СотрудникНаименование";
	
	Запрос.УстановитьПараметр("СписокСотрудников", 	МассивСотрудников);
	Запрос.УстановитьПараметр("ДатаНачала", 		НачалоМесяца);
	Запрос.УстановитьПараметр("ДатаОкончания", 		КонецМесяца);
	
	Возврат Запрос.Выполнить().Выгрузить(); 

КонецФункции // ПолучитьДанные()


Функция ПолучитьДанныеТабеля(НачалоМесяца)

		

КонецФункции // ПолучитьДанныеТабеля()

&НаКлиенте
Процедура Обновить(Команда)
	СформироватьТабель();
КонецПроцедуры
